ARMmbed/mbed-os/targets/TARGET_NXP/TARGET_MCUXpresso_MCUS/TARGET_MIMXRT1170/drivers/fsl_semc_nand_flash.c
    return status;
}

static status_t semc_nand_issue_access_feature(nand_handle_t *handle, nand_onfi_feature_config_t *featureConfig)
{
    status_t status                    = kStatus_Success;
    semc_mem_nand_handle_t *semcHandle = (semc_mem_nand_handle_t *)handle->deviceSpecific;

    /* SET/GET FEATURES command is accepted by the target only when all die (LUNs) on the target are idle. */
    uint16_t commandCode = SEMC_BuildNandIPCommand(featureConfig->command,
                                                   kSEMC_NANDAM_ColumnCA0,       // CA1
                                                   kSEMC_NANDCM_CommandAddress); // Commmand Address
    status = SEMC_SendIPCommand((SEMC_Type *)handle->driverBaseAddr, kSEMC_MemType_NAND, featureConfig->address,
                                commandCode, 0, NULL);
    if (status != kStatus_Success)
    {
        return status;
    }

    if (featureConfig->command == (uint8_t)kNandDeviceCmd_ONFI_SetFeatures)
    {
        status = SEMC_IPCommandNandWrite((SEMC_Type *)handle->driverBaseAddr, 0, featureConfig->parameter,
                                         sizeof(featureConfig->parameter));
        if (status != kStatus_Success)
        {
            return status;
        }
        /* Note: From Spec, both R/B and SR can be used to determine the progress,
            but actually only when we choose R/B, then it works well on the EVB and FPGA. */
        if (semcHandle->readyCheckOption == (uint8_t)kNandReadyCheckOption_RB)
        {
            status = semc_nand_wait_status_ready(handle, NAND_READY_CHECK_INTERVAL_NORMAL, false);
        }
        else
        {
            /* Just delay some time to workaround issue */
            semcHandle->delayUS(NAND_MAX_FEATURE_ACCESS_TIME_tFEAT_US);
        }
    }
    else if (featureConfig->command == (uint8_t)kNandDeviceCmd_ONFI_GetFeatures)
    {
        /* Note: From Spec, both R/B and SR can be used to determine the progress,
            but actually only when we choose R/B, then it works well on the EVB and FPGA. */
        if (semcHandle->readyCheckOption == (uint8_t)kNandReadyCheckOption_RB)
        {
            status = semc_nand_wait_status_ready(handle, NAND_READY_CHECK_INTERVAL_NORMAL, true);
            if (status != kStatus_Success)
            {
                return status;
            }
        }
        else
        {
            /* Just delay some time to workaround issue */
            semcHandle->delayUS(NAND_MAX_FEATURE_ACCESS_TIME_tFEAT_US);
        }

        status = SEMC_IPCommandNandRead((SEMC_Type *)handle->driverBaseAddr, 0, featureConfig->parameter,
                                        sizeof(featureConfig->parameter));
    }
    else
    {
        ; /* Intentional empty */
    }

    return status;
}

static status_t semc_nand_issue_read_parameter(nand_handle_t *handle, nand_onfi_parameter_config_t *parameterConfig)
{
    status_t status = kStatus_Success;
    uint32_t readyCheckIntervalInUs;
    semc_mem_nand_handle_t *semcHandle = (semc_mem_nand_handle_t *)handle->deviceSpecific;

    uint16_t commandCode = SEMC_BuildNandIPCommand(kNandDeviceCmd_ONFI_ReadParameterPage,
                                                   kSEMC_NANDAM_ColumnCA0,       // 1 byte address
                                                   kSEMC_NANDCM_CommandAddress); // Command Address
    status = SEMC_SendIPCommand((SEMC_Type *)handle->driverBaseAddr, kSEMC_MemType_NAND, 0, commandCode, 0, NULL);
    if (status != kStatus_Success)
    {
        return status;
    }

    // Note2: ReadStatus may be used to check the status of Read Parameter Page during execution.
    // Note3: Use of the ReadStatusEnhanced command is prohibited during the power-on
    //  Reset command and when OTP mode is enabled. It is also prohibited following
    //  some of the other reset, identification, and configuration operations.
    readyCheckIntervalInUs = (NAND_MAX_READ_PARAMETER_PAGE_TIME_tR_US > semcHandle->pageReadTimeInUs_tR) ?
                                 NAND_MAX_READ_PARAMETER_PAGE_TIME_tR_US :
                                 semcHandle->pageReadTimeInUs_tR;
    if (semcHandle->readyCheckOption == (uint8_t)kNandReadyCheckOption_RB)
    {
        status = semc_nand_wait_status_ready(handle, readyCheckIntervalInUs, true);
        if (status != kStatus_Success)
        {
            return status;
        }
    }
    else
    {
        semcHandle->delayUS(readyCheckIntervalInUs);
    }

    // Only ipg command is supported here
    status = SEMC_IPCommandNandRead((SEMC_Type *)handle->driverBaseAddr, 0, (uint8_t *)parameterConfig,
                                    sizeof(nand_onfi_parameter_config_t));

    return status;
}

status_t semc_nand_issue_read_status(nand_handle_t *handle, uint8_t *stat)
{
    status_t status      = kStatus_Success;
    uint32_t readoutData = 0x00U;
    uint16_t commandCode;
    uint32_t slaveAddress;
    semc_mem_nand_handle_t *semcHandle = (semc_mem_nand_handle_t *)handle->deviceSpecific;

    /* Note: If there is only one plane per target, the READ STATUS (70h) command can be used
       to return status following any NAND command.
       Note: In devices that have more than one plane per target, during and following interleaved
       die (multi-plane) operations, the READ STATUS ENHANCED command must be used to select the
       die (LUN) that should report status.
    */
    if (semcHandle->statusCommandType == (uint8_t)kNandStatusCommandType_Enhanced)
    {
        /* READ STATUS ENHANCED command is accepted by all planes in device even when they are busy (RDY = 0).*/
        commandCode  = SEMC_BuildNandIPCommand(kNandDeviceCmd_ONFI_ReadStatusEnhanced,
                                              kSEMC_NANDAM_RawRA0RA1RA2,        // 3 Byte-RA0/RA1/RA2
                                              kSEMC_NANDCM_CommandAddressRead); // Commmand Address Read
        slaveAddress = semcHandle->rowAddressToGetSR;
    }
    else
    {
        /* READ STATUS command is accepted by device even when it is busy (RDY = 0). */
        commandCode = SEMC_BuildNandIPCommand(kNandDeviceCmd_ONFI_ReadStatus,
                                              kSEMC_NANDAM_ColumnRow,    // Don't care
                                              kSEMC_NANDCM_CommandRead); // Commmand Read

